In [1]:
import pandas as pd

In [2]:
rev_table = pd.read_html("https://mops.twse.com.tw/nas/t21/sii/t21sc03_111_1_0.html")

In [3]:
rev_df1 = rev_table[1] 

rev_df = rev_table[2]
rev_df.to_csv("./new.csv", index=False)
df = pd.read_csv("new.csv")

In [4]:
new_df = pd.DataFrame()

In [5]:
new_df["公司名稱"] = df["Unnamed: 1_level_0"]
new_df["當月營收"] = df["營業收入"]
new_df = new_df.drop(labels = [0, len(new_df)-1], axis = 0)

new_df

  公司名稱     當月營收
1   台泥  7517896
2   亞泥  7420726
3   嘉泥   158052
4   環泥   592322
5   幸福   324664
6   信大   566897
7   東泥   166858

In [6]:
# 取出產業名稱
rev_df1 = rev_table[1]  
string1 = rev_df1.columns[0]
string1 = (string1[4:])

In [7]:
new_df["產業別"] = string1

In [8]:
new_df = new_df.reset_index(drop=True)
new_df

  公司名稱     當月營收   產業別
0   台泥  7517896  水泥工業
1   亞泥  7420726  水泥工業
2   嘉泥   158052  水泥工業
3   環泥   592322  水泥工業
4   幸福   324664  水泥工業
5   信大   566897  水泥工業
6   東泥   166858  水泥工業

In [9]:
# 想法：
# 新增欄位= 產業 e.g 水泥
# index = stock 
# 取出公司名稱＋產業別＋當月營收[月份]
# 將所有的df concat 在一起
# 利用pandas的https://www.learncodewithmike.com/2021/04/pandas-groupby-and-aggregate-method.html 做整理 （漏斗）